In [12]:
import pandas as pd

data = pd.read_csv("dataset_banco.csv", delimiter=",")

data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45215 entries, 0 to 45214
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        45215 non-null  int64
 1   job        45213 non-null  object
 2   marital    45214 non-null  object
 3   education  45214 non-null  object
 4   default    45215 non-null  object
 5   balance    45213 non-null  float64
 6   housing    45215 non-null  object
 7   loan       45215 non-null  object
 8   contact    45215 non-null  object
 9   day        45215 non-null  int64
 10  month      45215 non-null  object
 11  duration   45214 non-null  float64
 12  campaign   45215 non-null  int64
 13  pdays      45214 non-null  float64
 14  previous   45215 non-null  int64
 15  poutcome   45215 non-null  object
 16  y          45215 non-null  object
dtypes: float64(3), int64(4), object(10)
memory usage: 5.9+ MB

In [13]:
data.dropna(inplace=True)

data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 45207 entries, 0 to 45214
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        45207 non-null  int64
 1   job        45207 non-null  object
 2   marital    45207 non-null  object
 3   education  45207 non-null  object
 4   default    45207 non-null  object
 5   balance    45207 non-null  float64
 6   housing    45207 non-null  object
 7   loan       45207 non-null  object
 8   contact    45207 non-null  object
 9   day        45207 non-null  int64
 10  month      45207 non-null  object
 11  duration   45207 non-null  float64
 12  campaign   45207 non-null  int64
 13  pdays      45207 non-null  float64
 14  previous   45207 non-null  int64
 15  poutcome   45207 non-null  object
 16  y          45207 non-null  object
dtypes: float64(3), int64(4), object(10)
memory usage: 6.2+ MB

In [14]:
data.drop_duplicates(inplace=True)

data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 45203 entries, 0 to 45214
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        45203 non-null  int64
 1   job        45203 non-null  object
 2   marital    45203 non-null  object
 3   education  45203 non-null  object
 4   default    45203 non-null  object
 5   balance    45203 non-null  float64
 6   housing    45203 non-null  object
 7   loan       45203 non-null  object
 8   contact    45203 non-null  object
 9   day        45203 non-null  int64
 10  month      45203 non-null  object
 11  duration   45203 non-null  float64
 12  campaign   45203 non-null  int64
 13  pdays      45203 non-null  float64
 14  previous   45203 non-null  int64
 15  poutcome   45203 non-null  object
 16  y          45203 non-null  object
dtypes: float64(3), int64(4), object(10)
memory usage: 6.2+ MB

In [15]:
del data["duration"]

data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 45203 entries, 0 to 45214
Data columns (total 16 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        45203 non-null  int64
 1   job        45203 non-null  object
 2   marital    45203 non-null  object
 3   education  45203 non-null  object
 4   default    45203 non-null  object
 5   balance    45203 non-null  float64
 6   housing    45203 non-null  object
 7   loan       45203 non-null  object
 8   contact    45203 non-null  object
 9   day        45203 non-null  int64
 10  month      45203 non-null  object
 11  campaign   45203 non-null  int64
 12  pdays      45203 non-null  float64
 13  previous   45203 non-null  int64
 14  poutcome   45203 non-null  object
 15  y          45203 non-null  object
dtypes: float64(2), int64(4), object(10)
memory usage: 5.9+ MB

In [16]:
cols_cat = ['job', 'marital', 'education', 'default', 'housing',
       'loan', 'contact', 'month', 'poutcome', 'y']

for col in cols_cat:
  print(f'Columna {col}: {data[col].nunique()} subniveles')

Columna job: 18 subniveles
Columna marital: 6 subniveles
Columna education: 10 subniveles
Columna default: 2 subniveles
Columna housing: 2 subniveles
Columna loan: 6 subniveles
Columna contact: 5 subniveles
Columna month: 12 subniveles
Columna poutcome: 6 subniveles
Columna y: 2 subniveles

In [7]:
data.describe()

,age,balance,day,campaign,pdays,previous
count,45203.000000,45203.000000,45203.000000,45203.000000,45203.000000,45203.000000
mean,41.005177,1373.893967,15.807115,2.763843,40.177709,0.580138
std,12.037387,3923.852086,8.323018,3.098168,100.104768,2.303344
min,18.000000,-8019.000000,1.000000,1.000000,-1.000000,0.000000
25%,33.000000,72.000000,8.000000,1.000000,-1.000000,0.000000
50%,39.000000,448.000000,16.000000,2.000000,-1.000000,0.000000
75%,48.000000,1427.500000,21.000000,3.000000,-1.000000,0.000000
max,776.000000,527532.000000,31.000000,63.000000,871.000000,275.000000

In [8]:
data[data["age"] > 100]

,age,job,marital,education,default,balance,housing,loan,contact,day,month,campaign,pdays,previous,poutcome,y
229,530,services,divorced,secondary,no,1467.0,yes,no,unknown,5,may,1,-1.0,0,unknown,no
1076,490,services,single,primary,no,114.0,yes,no,unknown,7,may,2,-1.0,0,unknown,no
2229,123,student,single,tertiary,no,250.0,yes,no,unknown,12,may,2,-1.0,0,unknown,no
3018,332,admin.,single,secondary,no,91.0,yes,no,unknown,14,may,2,-1.0,0,unknown,no
5799,311,self-employed,single,secondary,no,360.0,yes,no,unknown,26,may,4,-1.0,0,unknown,no
6053,399,blue-collar,married,primary,no,2805.0,yes,no,unknown,26,may,23,-1.0,0,unknown,no
28152,466,blue-collar,married,secondary,no,120.0,yes,yes,cellular,29,jan,1,259.0,3,failure,no
43530,776,retired,married,secondary,no,820.0,no,no,telephone,23,apr,4,-1.0,0,unknown,yes

In [17]:
data = data[data["age"] < 100]

data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 45195 entries, 0 to 45214
Data columns (total 16 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        45195 non-null  int64
 1   job        45195 non-null  object
 2   marital    45195 non-null  object
 3   education  45195 non-null  object
 4   default    45195 non-null  object
 5   balance    45195 non-null  float64
 6   housing    45195 non-null  object
 7   loan       45195 non-null  object
 8   contact    45195 non-null  object
 9   day        45195 non-null  int64
 10  month      45195 non-null  object
 11  campaign   45195 non-null  int64
 12  pdays      45195 non-null  float64
 13  previous   45195 non-null  int64
 14  poutcome   45195 non-null  object
 15  y          45195 non-null  object
dtypes: float64(2), int64(4), object(10)
memory usage: 5.9+ MB

In [18]:
data.to_excel("datosBanco.xlsx")

In [2]:
import pandas as pd


data = pd.read_excel('datosBanco.xlsx')

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45195 entries, 0 to 45194
Data columns (total 17 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  45195 non-null  int64
 1   age         45195 non-null  int64
 2   job         45195 non-null  object
 3   marital     45195 non-null  object
 4   education   45195 non-null  object
 5   default     45195 non-null  object
 6   balance     45195 non-null  int64
 7   housing     45195 non-null  object
 8   loan        45195 non-null  object
 9   contact     45195 non-null  object
 10  day         45195 non-null  int64
 11  month       45195 non-null  object
 12  campaign    45195 non-null  int64
 13  pdays       45195 non-null  int64
 14  previous    45195 non-null  int64
 15  poutcome    45195 non-null  object
 16  y           45195 non-null  object
dtypes: int64(7), object(10)
memory usage: 5.9+ MB

In [4]:
del data["Unnamed: 0"]

data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45195 entries, 0 to 45194
Data columns (total 16 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        45195 non-null  int64
 1   job        45195 non-null  object
 2   marital    45195 non-null  object
 3   education  45195 non-null  object
 4   default    45195 non-null  object
 5   balance    45195 non-null  int64
 6   housing    45195 non-null  object
 7   loan       45195 non-null  object
 8   contact    45195 non-null  object
 9   day        45195 non-null  int64
 10  month      45195 non-null  object
 11  campaign   45195 non-null  int64
 12  pdays      45195 non-null  int64
 13  previous   45195 non-null  int64
 14  poutcome   45195 non-null  object
 15  y          45195 non-null  object
dtypes: int64(6), object(10)
memory usage: 5.5+ MB

In [5]:
data['job'].unique()

array(['management', 'technician', 'entrepreneur', 'blue-collar',
       'unknown', 'Management', 'retired', 'admin.', 'services',
       'self-employed', 'MANAGEMENT', 'Self-employed', 'unemployed',
       'housemaid', 'student', 'Services', 'Retired', 'administrative'],
      dtype=object)

In [16]:
data.groupby('job')['age'].count()

job
MANAGEMENT           2
Management           2
Retired              1
Self-employed        1
Services             1
admin.            5165
administrative       3
blue-collar       9727
entrepreneur      1487
housemaid         1240
management        9453
retired           2262
self-employed     1577
services          4151
student            937
technician        7595
unemployed        1303
unknown            288
Name: age, dtype: int64

In [18]:
data['job'] = data['job'].str.replace('MANAGEMENT','management', regex=False)

data['job'] = data['job'].str.replace('Management', 'management', regex=False)

data['job'] = data['job'].str.replace('admin.', 'administrative', regex=False)

data['job'] = data['job'].str.replace('Self-employed', 'self-employed', regex=False)

data['job'] = data['job'].str.replace('Retired', 'retired', regex=False)

data['job'] = data['job'].str.replace('Services', 'services', regex=False)

data['job'].unique()

array(['management', 'technician', 'entrepreneur', 'blue-collar',
       'unknown', 'retired', 'administrative', 'services',
       'self-employed', 'unemployed', 'housemaid', 'student'],
      dtype=object)

In [19]:
data.groupby('job')['age'].count()

job
administrative    5168
blue-collar       9727
entrepreneur      1487
housemaid         1240
management        9457
retired           2263
self-employed     1578
services          4152
student            937
technician        7595
unemployed        1303
unknown            288
Name: age, dtype: int64